# ============================================
# ИМПОРТЫ
# ============================================
from dotenv import load_dotenv
import os

# ============================================
# ЗАГРУЗКА ПЕРЕМЕННЫХ ИЗ .env
# ============================================
load_dotenv()

# ============================================
# НАСТРОЙКИ ТЕЛЕГРАМ БОТА
# ============================================
BOT_TOKEN = os.getenv('BOT_TOKEN')

# ============================================
# НАСТРОЙКИ GMAIL
# ============================================
GMAIL_USER = os.getenv('GMAIL_USER')
GMAIL_PASSWORD = os.getenv('GMAIL_PASSWORD')

# ============================================
# НАСТРОЙКИ IMAP
# ============================================
IMAP_SERVER = "imap.gmail.com"
IMAP_PORT = 993
